tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "d12frosted/emacs-plus"
tap "garethr/kubeval"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"
tap "uswitch/uswitch-tools", "git@github.com:uswitch/homebrew-uswitch-tools.git"

cask "java"
# Search tool like grep, but optimized for programmers
brew "ack"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Lightweight Linux for Docker
brew "boot2docker"
# Reimplementation of ctags(1)
brew "ctags"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Isolated development environments using Docker
brew "docker-compose", link: false
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU Emacs text editor
brew "emacs"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Manage compile and link flags for libraries
brew "pkg-config"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line client for the cloud PaaS
brew "heroku"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Build tool for Clojure
brew "leiningen"
# International domain name library
brew "libidn"
# Text-based web browser
brew "lynx"
# Keep your Mac's application settings in sync
brew "mackup"
# High performance, distributed memory object caching system
brew "memcached"
# High-performance, schema-free, document-oriented database
brew "mongodb", restart_service: true
# Cross platform, open source .NET development framework
brew "mono"
# Open source relational database management system
brew "mysql", restart_service: true
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql", restart_service: true
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Install Ruby, JRuby, Rubinius, MagLev, or mruby
brew "ruby-install"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8", link: false
# Google's open source JavaScript engine
brew "v8@3.15"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", link: false
# Validate your Kubernetes configurations
brew "garethr/kubeval/kubeval"
# Amazon Secure Token Service helper
brew "uswitch/uswitch-tools/stscreds"
cask "adobe-creative-cloud"
cask "base"
cask "caffeine"
cask "charles"
cask "chromium"
cask "docker"
cask "dropbox"
cask "fiddler"
cask "firefoxdeveloperedition"
cask "flux"
cask "google-drive"
cask "haskell-platform"
cask "iterm2"
cask "kaleidoscope"
cask "lastpass"
cask "mono-mdk"
cask "ngrok"
cask "omnigraffle"
cask "paw"
cask "postico"
cask "psequel"
cask "robomongo"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "vmware-fusion"
cask "caskroom/fonts/font-3270-nerd-font-mono"
cask "caskroom/fonts/font-anonymouspro-nerd-font-mono"
cask "caskroom/fonts/font-aurulentsansmono-nerd-font-mono"
cask "caskroom/fonts/font-bitstreamverasansmono-nerd-font-mono"
cask "caskroom/fonts/font-codenewroman-nerd-font-mono"
cask "caskroom/fonts/font-dejavusansmono-nerd-font-mono"
cask "caskroom/fonts/font-droidsansmono-nerd-font-mono"
cask "caskroom/fonts/font-fantasquesansmono-nerd-font-mono"
cask "caskroom/fonts/font-firacode-nerd-font-mono"
cask "caskroom/fonts/font-firamono-nerd-font-mono"
cask "caskroom/fonts/font-gohu-nerd-font-mono"
cask "caskroom/fonts/font-hack-nerd-font-mono"
cask "caskroom/fonts/font-hasklig-nerd-font-mono"
cask "caskroom/fonts/font-heavydata-nerd-font-mono"
cask "caskroom/fonts/font-hermit-nerd-font-mono"
cask "caskroom/fonts/font-inconsolata-nerd-font-mono"
cask "caskroom/fonts/font-iosevka-nerd-font-mono"
cask "caskroom/fonts/font-lekton-nerd-font-mono"
cask "caskroom/fonts/font-liberationmono-nerd-font-mono"
cask "caskroom/fonts/font-meslo-nerd-font-mono"
cask "caskroom/fonts/font-monofur-nerd-font-mono"
cask "caskroom/fonts/font-monoid-nerd-font-mono"
cask "caskroom/fonts/font-mononoki-nerd-font-mono"
cask "caskroom/fonts/font-mplus-nerd-font-mono"
cask "caskroom/fonts/font-profont-nerd-font-mono"
cask "caskroom/fonts/font-proggyclean-nerd-font-mono"
cask "caskroom/fonts/font-robotomono-nerd-font-mono"
cask "caskroom/fonts/font-sharetechmono-nerd-font-mono"
cask "caskroom/fonts/font-sourcecodepro-nerd-font-mono"
cask "caskroom/fonts/font-spacemono-nerd-font-mono"
cask "caskroom/fonts/font-terminus-nerd-font-mono"
cask "caskroom/fonts/font-ubuntumono-nerd-font-mono"
cask "caskroom/versions/google-chrome-canary"
