tap 'caskroom/cask'

cask 'google-chrome'
cask 'firefox'

cask 'adobe-creative-cloud'
cask 'sketchup' # 3d modelling
cask 'omnigraffle' 

cask 'spotify'
cask 'dropbox'

cask 'skype'

cask 'base' # sqlite db editor
cask 'sequel-pro' # MySql gui
cask 'robomongo' # Monogodb gui
cask 'postico' # posgresql
cask 'psequel' # posgresql

cask 'sublime-text'
cask 'mou' # markdown editor

cask 'sourcetree'
cask 'paw' # http client
cask 'vmware-fusion' # http client

cask 'spectacle' # window manager
cask 'caffeine'

cask 'transmission'

cask 'the-unarchiver'

brew 'fish' # fish shell

tap 'thoughtbot/formulae'
brew 'rcm'

brew 'vim'
brew 'rbenv'
brew 'ruby-install'

brew 'heroku-toolbelt'
